[
  {
    "title": "BasilicEVM",
    "slug": "basilic-evm",
    "description": "BasilicEVM is a performance-optimized development stack for EVM applications. Built with Foundry, viem/wagmi, and Next.js 15, it features AI-powered development workflows, specialized cursor rules, and streamlined UI generation. The stack includes smart contracts, chain integration, frontend components, and data layer with Ponder indexing.",
    "technologies": [
      "TypeScript",
      "Solidity",
      "Foundry",
      "NextJS",
      "Ponder",
      "Postgres",
      "Viem",
      "Wagmi",
      "EVM",
      "ThirdWeb",
      "AI"
    ],
    "tags": ["web3", "oss"],
    "link": "https://github.com/blockmatic/basilic-evm",
    "image": "https://gaboesquivel.com/images/work/basilic-evm.png",
    "repo": "https://github.com/blockmatic/basilic-evm",
    "achievements": [
      "Developed a modular architecture for EVM applications, improving scalability and maintainability.",
      "Integrated AI-powered development workflows to optimize smart contract and frontend development."
    ],
    "story": [
      "BasilicEVM emerged from my extensive experience with EVM-based applications and the need for a more streamlined, performance-optimized development stack. The project combines cutting-edge technologies like Foundry, viem/wagmi, and Next.js 15 to create a comprehensive solution for building scalable blockchain applications.",
      "By integrating AI-powered development workflows and specialized cursor rules, we've significantly improved developer productivity and code quality. The incorporation of Ponder indexing and Supabase has enabled real-time data processing capabilities, making it easier to build responsive and efficient dApps.",
      "The project continues to evolve with community feedback, focusing on maintainability, performance, and developer experience. Our modular architecture ensures that teams can easily adapt and extend the stack to meet their specific needs."
    ]
  },
  {
    "title": "bitlauncher",
    "slug": "bitlauncher",
    "description": "BitLauncher is an AI and crypto launchpad platform that provides early access to promising AI unicorn startups through token sales and auctions. It features a batch auction system for token sales, ensuring fair and transparent price discovery. Participants bid during a fixed period, and tokens are distributed at a uniform price, eliminating manipulation and ensuring equal opportunities for all investors.",
    "technologies": [
      "TypeScript",
      "Solidity",
      "Hardhat",
      "NextJS",
      "Viem",
      "Wagmi",
      "NodeJS",
      "PostgreSQL"
    ],
    "tags": ["web3", "ai", "oss", "full-time", "lead"],
    "link": "https://bitlauncher.ai",
    "image": "https://gaboesquivel.com/images/work/bitlauncher.png",
    "video": "https://www.youtube.com/watch?v=U6vn3KOEwcQ",
    "repo": "https://github.com/bitcashorg/smartevm",
    "achievements": [
      "Designed full-stack architecture using Viem, Wagmi, Alchemy, Trigger.dev, Supabase, Next.js 14, and ShadcnUI for a scalable and responsive platform.",
      "Developed a custom token bridge for swapping USDT, USDC, and BITUSD to USDCred tokens, enabling seamless bidding within the platform.",
      "Implemented a transaction data indexing system using Supabase for efficient querying, real-time subscriptions, and data aggregation analytics.",
      "Deployed Gnosis auction Solidity contracts to EOS EVM and created a bidding interface with real-time updates via Supabase subscriptions.",
      "Developed a wallet interface displaying real-time EVM balances through Wagmi token balance subscriptions and EOS token balances via RPC polling.",
      "Integrated AI SDK for internationalization automation and established AI-driven development workflow using v0.dev, Anthropic Claude Sonnet, Cursor IDE, and SourceryAI.",
      "Built a custom indexer for EOS EVM using Node.js, Viem EVM event subscriptions, and dFuse stream for EOS.",
      "Implemented AI SDK integration and chat prompting mechanism for masterbots.ai, featuring specialized AI agents."
    ],
    "story": [
      "BitLauncher was conceived as a cutting-edge AI and crypto launchpad platform, designed to provide early access to promising AI unicorn startups through token sales and auctions. By creating a decentralized platform, I aimed to democratize the investment process, ensuring that all participants have a fair chance to contribute and benefit.",
      "The platform's batch auction system is a testament to this commitment, offering a transparent and manipulation-free environment for token sales. By distributing tokens at a uniform price, we eliminated the traditional barriers and biases often present in fundraising. The integration of advanced technologies like Viem, Wagmi, and Supabase ensures a seamless and responsive user experience.",
      "This project was developed with the same talented team behind https://bitcash.org, with whom I've been contributing since 2020. Our shared expertise and dedication to innovation have been instrumental in bringing BitLauncher to life, reflecting our ongoing commitment to fostering inclusivity in the AI and blockchain communities."
    ]
  },
  {
    "title": "Masterbots",
    "slug": "masterbots",
    "description": "Masterbots.ai is a platform that aims to elevate AI beyond ChatGPT by providing specialized chatbots, social sharing features, and user-friendly innovation. It features domain-specific AI chatbots that can perform more advanced tasks beyond basic information lookup or simple conversations.",
    "technologies": [
      "NextJS",
      "NodeJS",
      "GraphQL",
      "PostgreSQL",
      "TypeScript",
      "AI SDK",
      "LLMs"
    ],
    "tags": ["ai", "oss"],
    "link": "https://masterbots.ai",
    "image": "https://gaboesquivel.com/images/work/masterbots.png",
    "repo": "https://github.com/bitcashorg/masterbots",
    "achievements": [
      "Integrated AI SDK for internationalization automation and AI-driven workflow.",
      "Developed specialized AI agents and chatbot interfaces for various use cases.",
      "Set up a scalable Next.js architecture and trained the team for effective implementation."
    ],
    "story": [
      "Masterbots.ai was developed to push the boundaries of AI capabilities, moving beyond the limitations of traditional chatbots like ChatGPT. By focusing on domain-specific AI chatbots, the platform provides users with advanced conversational tools that can handle complex tasks and deliver more than just basic information.",
      "The integration of AI SDKs and the development of specialized AI agents were central to this project. These innovations allowed us to automate internationalization and establish an AI-driven workflow, enhancing the platform's ability to cater to diverse user needs and preferences.",
      "This project was developed by the same team behind bitcash.org and bitlauncher.ai, with whom I've been collaborating to drive innovation in AI and blockchain technologies. Our shared vision and expertise have been instrumental in creating Masterbots.ai, reflecting our commitment to advancing AI technology and transforming digital interactions."
    ]
  },
  {
    "title": "ZTX",
    "slug": "ztx",
    "description": "ZTX, a web3 metaverse platform, enables creators to build, play, and earn. Supported by Jump Crypto and ZEPETO, it integrates blockchain for NFT trading.\n As a software consultant in the early stages of ZTX, I was responsible for developing the react app to host the metaverse and the WebGL/EVM wallet integration.",
    "technologies": [
      "WebGL",
      "Ethereum",
      "Ethers",
      "NFT",
      "AWS",
      "Node.js",
      "ReactJS",
      "NextJS"
    ],
    "tags": ["web3", "full-time"],
    "link": "https://ztx.io",
    "image": "https://gaboesquivel.com/images/work/ztx.png",
    "video": "https://www.youtube.com/watch?v=h58y6UzZ7RA",
    "achievements": [
      "Set up the initial React architecture using Next.js, TailwindCSS, and Framer Motion.",
      "Developed a WebGL EVM wallet connector using Ethers.js.",
      "Implemented advanced analytics and reporting using Google Tag Manager."
    ],
    "story": [
      "ZTX represents a pioneering effort in the web3 metaverse space, enabling creators to build, play, and earn within a blockchain-integrated environment. As a software consultant during its early stages, I played a crucial role in developing the React app that hosts the metaverse, ensuring seamless integration with blockchain technology.",
      "My work involved setting up the initial architecture using Next.js, TailwindCSS, and Framer Motion, which provided a robust foundation for the platform's interactive features. Additionally, I developed a WebGL EVM wallet connector using Ethers.js, facilitating secure and efficient NFT trading within the metaverse.",
      "Supported by Jump Crypto and ZEPETO, ZTX continues to evolve, offering creators new opportunities to engage with blockchain technology. My contributions to the project reflect my commitment to innovation and my ability to integrate complex technologies into user-friendly applications."
    ]
  },
  {
    "title": "RareMint",
    "slug": "raremint",
    "description": "RareMint digitizes real-world sports collectibles as NFTs, offering a digital collectible experience.\n I led technical efforts at RareMint to enhance the NFT marketplace's performance and maintainability. Additionally, I supported integrating the platform with the Polygon network for auctions.",
    "technologies": [
      "EVM",
      "Ethers",
      "NFT",
      "React",
      "GCloud",
      "NodeJS",
      "GraphQL",
      "TypeScript"
    ],
    "tags": ["web3", "full-time"],
    "link": "https://raremint.com",
    "image": "https://gaboesquivel.com/images/work/raremint.png",
    "video": "https://www.youtube.com/watch?v=2wh32w7N9xg",
    "images": [
      "https://gaboesquivel.com/images/work/raremint-perf.jpeg"
    ],
    "achievements": [
      "Built an EVM NFT data indexer using Moralis streams, Node.js, and PostgreSQL.",
      "Refactored the marketplace using RemixRun SSR for improved performance and responsiveness.",
      "Integrated Wallet Connect for secure transactions and improved user experience."
    ],
    "story": [
      "RareMint is at the forefront of digitizing real-world sports collectibles as NFTs, providing a unique digital collectible experience. As the technical lead, I focused on enhancing the marketplace's performance and maintainability, ensuring a seamless user experience.",
      "My role involved building an EVM NFT data indexer using Moralis streams, Node.js, and PostgreSQL, which enabled efficient data processing and retrieval. Additionally, I refactored the marketplace using RemixRun SSR, significantly improving its performance and responsiveness.",
      "By integrating Wallet Connect, I ensured secure transactions and enhanced user experience, making RareMint a reliable platform for NFT enthusiasts. My contributions reflect my dedication to leveraging blockchain technology to create innovative digital solutions."
    ]
  },
  {
    "title": "bitcashBank",
    "slug": "bitcashbank",
    "description": "Bitcash allows users to buy, trade, deposit, and earn on cryptocurrencies, with a focus on exchanging funds for local currency stablecoins or bitUSD. The platform also features BitcashDAO for community-based decision-making.\n At Bitcash, my role from the start focused on infrastructure design, tech recruitment, and developer training. I later transitioned to a consulting role to guide the platform's continuous adaptation and success.",
    "technologies": [
      "Antelope",
      "C++",
      "ReactJS",
      "GCloud",
      "NodeJS",
      "GraphQL",
      "PostgreSQL",
      "TypeScript"
    ],
    "tags": ["web3", "contract", "lead"],
    "link": "https://bitcash.org",
    "image": "https://gaboesquivel.com/images/work/bitcash-bank.png",
    "video": "https://www.youtube.com/watch?v=2JuHy_w0Ct4",
    "repo": "https://github.com/bitcashorg",
    "achievements": [
      "Led infrastructure design and deployment, improving scalability and security.",
      "Built and optimized BitcashDAO for efficient community governance.",
      "Developed robust GraphQL APIs for seamless blockchain data retrieval."
    ],
    "story": [
      "BitcashBank is a comprehensive platform that empowers users to engage with cryptocurrencies, offering services like buying, trading, depositing, and earning. My initial role focused on designing the infrastructure, recruiting technical talent, and training developers to ensure a robust foundation for the platform.",
      "As the platform evolved, I transitioned to a consulting role, guiding its continuous adaptation and success. I played a key role in building and optimizing BitcashDAO, which facilitates community-based decision-making, ensuring that the platform remains responsive to user needs.",
      "To enhance the platform's capabilities, I developed chaingraph.io to support real-time updates and set up WebAuthn integration with the EOSIO blockchain for a 'walletless' experience, bypassing app stores and providing a super secure environment for users. This approach enabled a pure PWA, bypassing app stores and providing a super secure environment for users. My contributions to the project reflect a dedication to creating a secure and user-friendly environment for cryptocurrency enthusiasts."
    ]
  },
  {
    "title": "Emanate",
    "slug": "emanate",
    "description": "Emanate is a Web3-powered network marketplace for the music industry, streamlining music creation, distribution, and monetization.\n At Emanate, I maintained the ReactJS web app streaming platform and the back office for artist revenue distribution.",
    "technologies": ["ReactJS", "TypeScript", "EOS", "AWS"],
    "tags": ["web3", "contract"],
    "link": "https://emanate.live",
    "image": "https://gaboesquivel.com/images/work/emanate.png",
    "video": "https://www.youtube.com/watch?v=qjmn7M7YC9g",
    "achievements": [
      "Maintained and optimized the ReactJS streaming platform for improved performance.",
      "Developed back-office tools for efficient artist revenue distribution.",
      "Integrated AWS cloud solutions for enhanced scalability."
    ],
    "story": [
      "Emanate is a revolutionary Web3-powered network marketplace designed to transform the music industry by streamlining music creation, distribution, and monetization. My role at Emanate involved maintaining and optimizing the ReactJS web app streaming platform, ensuring a seamless and high-performance user experience.",
      "I developed back-office tools that facilitated efficient artist revenue distribution, allowing artists to receive their earnings promptly and transparently. This was achieved by leveraging the power of blockchain technology to ensure accuracy and trust in financial transactions.",
      "Additionally, I integrated AWS cloud solutions to enhance the platform's scalability, enabling it to handle increased user demand and data processing requirements. My contributions to Emanate reflect my commitment to leveraging technology to create innovative solutions that empower artists and transform the music industry."
    ]
  },
  {
    "title": "Make Sense Labs",
    "slug": "make-sense-labs",
    "description": "Sense.chat, developed by Sense, a blockchain and DeFi company, is a secure chat and transaction app focusing on user data privacy.\n My role at Sense involved enhancing the React Native app's performance and integrating it with the EOS mainnet for token functionality.",
    "technologies": ["React Native", "TypeScript", "Blockchain", "EOS"],
    "tags": ["web3", "contract"],
    "link": "https://www.youtube.com/watch?v=2DJxzYDaAz8",
    "image": "https://gaboesquivel.com/images/work/sense-chat.png",
    "video": "https://www.youtube.com/watch?v=2DJxzYDaAz8",
    "achievements": [
      "Improved app performance and reduced load times by optimizing React Native components.",
      "Integrated EOS mainnet functionalities for secure blockchain-based transactions.",
      "Enhanced security and privacy features for better user protection."
    ],
    "story": [
      "At Make Sense Labs, I worked on Sense.chat, a secure chat and transaction app that prioritizes user data privacy. My primary focus was on enhancing the performance of the React Native app, ensuring a smooth and responsive user experience.",
      "I successfully integrated the app with the EOS mainnet, enabling secure blockchain-based transactions and token functionalities. This integration included a built-in wallet and token incentives for communities, providing users with a reliable and efficient platform for their digital interactions.",
      "In addition to performance improvements, I enhanced the app's security and privacy features, reinforcing user protection. My contributions to Make Sense Labs reflect my dedication to developing secure and user-friendly blockchain applications."
    ]
  },
  {
    "title": "EOS Costa Rica",
    "slug": "eos-costa-rica",
    "description": "EOS Costa Rica provides infrastructure for EOSIO blockchains and custom smart contract development.\n Joining EOS Costa Rica at its inception, I played a key role in the EOS mainnet launch, managed validators for multiple networks, and helped establish the custom development services division. My major contribution included leading the architecture for a custom private blockchain for Grant Thornton.",
    "technologies": [
      "EOS",
      "C++",
      "PostgreSQL",
      "Cloud",
      "NodeJS",
      "GraphQL",
      "ReactJS"
    ],
    "tags": ["web3", "full-time", "lead"],
    "link": "https://eoscostarica.io",
    "image": "https://gaboesquivel.com/images/work/eoscostarica.png",
    "repo": "https://github.com/eoscostarica",
    "video": "https://www.youtube.com/watch?v=-1y0fGs8Xgw&",
    "achievements": [
      "Played a key role in the EOS mainnet launch, ensuring network stability and security.",
      "Led the development of a custom private blockchain for Grant Thornton.",
      "Managed validator nodes across multiple EOSIO-based networks."
    ],
    "story": [
      "Joining EOS Costa Rica at its inception, I was instrumental in the launch of the EOS mainnet, where I ensured network stability and security. My role involved managing validator nodes across multiple EOSIO-based networks, which was crucial for maintaining the integrity and performance of the blockchain.",
      "As the main architect and tech lead, I recruited the team and built the architecture for Grant Thornton's custom private blockchain using Azure, Terraform, EOSIO, and a React client. This project demonstrated my ability to design and implement comprehensive blockchain solutions tailored to enterprise needs.",
      "I was also responsible for open source software and developer relations, fostering a community of collaboration and innovation. Throughout my time at EOS Costa Rica, I contributed to establishing the custom development services division, which expanded our capabilities and offerings. My work reflects a commitment to innovation and excellence in the blockchain space, helping to position EOS Costa Rica as a leader in the industry."
    ]
  },
  {
    "title": "EOS Rate",
    "slug": "eos-rate",
    "description": "EOS Rate is a community-driven tool for rating EOS Block Producers, featuring a radial graph and community input stored on the blockchain.\n In this project, I was responsible for the technical architecture and selecting the appropriate technology.",
    "technologies": ["EOS", "C++", "GraphQL", "ReactJS"],
    "tags": ["web3", "oss"],
    "link": "https://eosrate.io",
    "image": "https://gaboesquivel.com/images/work/eosrate.png",
    "repo": "https://github.com/eoscostarica/eos-rate",
    "video": "https://www.youtube.com/watch?v=saZnZqJsMhk",
    "achievements": [
      "Designed and implemented a decentralized rating system for EOS Block Producers.",
      "Built an intuitive radial graph interface to visualize community ratings.",
      "Developed a GraphQL API for seamless data retrieval and user interaction."
    ],
    "story": [
      "EOS Rate was developed as a community-driven tool to provide transparency and accountability in the EOS ecosystem. By allowing users to rate EOS Block Producers, the platform fosters a more informed and engaged community.",
      "I was responsible for the technical architecture and technology selection, ensuring that the platform was both robust and user-friendly. The decentralized rating system and intuitive radial graph interface were key components in achieving this goal.",
      "The project highlights my ability to integrate blockchain technology with user-centric design, creating tools that empower communities and enhance transparency. EOS Rate continues to serve as a valuable resource for the EOS community, reflecting my commitment to open-source development and innovation."
    ]
  },
  {
    "title": "Knowledge.io",
    "slug": "knowledge-io",
    "description": "Knowledge is a platform that rewards users for sharing information, recognized through a token system.\n My role at Knowledge included leading the architecture of the token and supporting systems for a successful ICO, and forming a skilled development team.",
    "technologies": [
      "Ethereum",
      "Solidity",
      "AWS",
      "Serverless",
      "GraphQL",
      "React Native",
      "React",
      "Node.js"
    ],
    "tags": ["web3", "contract", "oss"],
    "link": "https://github.com/knowledge/ethereum-contracts",
    "image": "https://gaboesquivel.com/images/work/knowledge.png",
    "repo": "https://github.com/knowledge",
    "achievements": [
      "Led the development and deployment of Knowledge.io's token system.",
      "Designed and implemented smart contracts for token rewards and transactions.",
      "Built a scalable serverless infrastructure to support the platform's growth."
    ],
    "story": [
      "Knowledge.io is a platform that incentivizes users to share information by rewarding them with tokens. My role involved leading the architecture of the token and supporting systems, which were crucial for the platform's successful ICO.",
      "I designed and implemented smart contracts that facilitated token rewards and transactions, ensuring a secure and efficient system. Additionally, I built a scalable serverless infrastructure using AWS, which supported the platform's growth and adaptability.",
      "By forming a skilled development team, I ensured that Knowledge.io could continue to innovate and expand its offerings. My contributions reflect a commitment to leveraging blockchain technology to create rewarding and engaging user experiences."
    ]
  },
  {
    "title": "ChainGraph",
    "slug": "chaingraph",
    "description": "This real-time GraphQL toolkit is designed for EOSIO/Antelope blockchain applications, offering features like data subscriptions and querying multiple blockchains.\n As a personal side project during my time at Bitcash, I was responsible for the architectural design, technology selection, and coding of the toolkit, including a real-time blockchain data streaming package.",
    "technologies": [
      "Antelope",
      "NodeJS",
      "Docker",
      "GraphQL",
      "GCloud",
      "RXJS",
      "ReactJS"
    ],
    "tags": ["web3", "oss"],
    "link": "https://chaingraph.io",
    "image": "https://gaboesquivel.com/images/work/chaingraph.png",
    "repo": "https://github.com/chaingraph",
    "achievements": [
      "Developed a real-time GraphQL subscription toolkit for EOSIO/Antelope blockchains.",
      "Implemented blockchain data indexing and event streaming capabilities.",
      "Designed an intuitive developer interface for querying multiple blockchain networks."
    ],
    "story": [
      "ChainGraph was developed as a real-time GraphQL toolkit for EOSIO/Antelope blockchain applications, providing developers with powerful tools for data subscriptions and querying across multiple blockchains.",
      "As a personal side project during my time at Bitcash, I took on the responsibility of architectural design, technology selection, and coding of the toolkit. This included developing a real-time blockchain data streaming package that enhanced the platform's capabilities.",
      "The project reflects my passion for blockchain technology and my commitment to creating open-source tools that empower developers. ChainGraph continues to serve as a valuable resource for those working with EOSIO/Antelope blockchains, showcasing my ability to innovate and deliver impactful solutions."
    ]
  },
  {
    "title": "Fantasy Top Shots",
    "slug": "fantasy-top-shots",
    "description": "The mobile app game based on NBA Top Shot NFTs was developed for the 2022 Flow Hackathon. It leverages the popularity of NBA Top Shot NFTs to create an engaging gaming experience.\n My contribution to this project was in the game's design and development, utilizing my skills in blockchain technology and mobile app development.",
    "technologies": [
      "Flow Blockchain",
      "NFT",
      "React",
      "React Native with Expo",
      "Tailwind"
    ],
    "tags": ["web3", "hackathon"],
    "link": "https://fantasy-top-shot.vercel.app",
    "image": "https://gaboesquivel.com/images/work/fantasy-top-shots.png",
    "video": "https://www.youtube.com/watch?v=Il2aiKhy_ug",
    "repo": "https://github.com/bitcashorg/fantasy-top-shot",
    "achievements": [
      "Designed and developed the mobile game using Flow blockchain technology.",
      "Integrated NBA Top Shot NFTs for an immersive gaming experience.",
      "Implemented responsive UI and smooth gameplay mechanics using React Native and Expo."
    ],
    "story": [
      "Fantasy Top Shots was created as part of the 2022 Flow Hackathon, leveraging the popularity of NBA Top Shot NFTs to deliver an engaging and interactive gaming experience. The game allows users to utilize their NBA Top Shot NFTs in a fantasy sports setting, adding a new dimension to the NFT experience.",
      "My role in the project involved both the design and development of the game, where I applied my expertise in blockchain technology and mobile app development. By integrating Flow blockchain technology, we ensured secure and efficient handling of NFT transactions within the game.",
      "The project was a collaborative effort that showcased the potential of combining blockchain technology with mobile gaming. It provided a platform for users to engage with their NFTs in a novel way, enhancing the value and utility of their digital assets. Fantasy Top Shots stands as a testament to the collaborative efforts of the Bitlauncher team and the innovative possibilities within the NFT and gaming spaces."
    ]
  },
  {
    "title": "Substrate Contracts UI",
    "slug": "substrate-contracts-ui",
    "description": "Substrate Contracts UI is a web application for deploying and interacting with WASM smart contracts on Substrate blockchains.\n I contributed to the project by enhancing code quality through multiple open-source contributions and gained experience in building dApps with Substrate.",
    "technologies": ["Polkadot", "Substrate", "React", "Tailwind"],
    "tags": ["web3", "oss"],
    "link": "https://contracts-ui.substrate.io/",
    "image": "https://gaboesquivel.com/images/work/contracts-ui.png",
    "repo": "https://github.com/paritytech/contracts-ui",
    "achievements": [
      "Enhanced code quality and performance through multiple open-source contributions.",
      "Developed UI components for seamless interaction with WASM smart contracts.",
      "Gained extensive experience in building dApps on the Substrate framework."
    ],
    "story": [
      "Substrate Contracts UI is a web application designed to facilitate the deployment and interaction with WASM smart contracts on Substrate blockchains. My involvement in the project focused on enhancing code quality and performance through multiple open-source contributions.",
      "I developed UI components that allowed for seamless interaction with WASM smart contracts, ensuring that the application was both user-friendly and efficient. This work provided me with extensive experience in building decentralized applications (dApps) on the Substrate framework.",
      "I contributed to this project while exploring Polkadot's ecosystem and learning about their protocol and how to write smart contracts. The project highlights my commitment to open-source development and my ability to contribute to complex blockchain projects. Substrate Contracts UI continues to serve as a valuable tool for developers working with Substrate blockchains, reflecting my dedication to innovation and collaboration in the blockchain space."
    ]
  },
  {
    "title": "Wizard World",
    "slug": "wizard-world",
    "description": "A progressive web app connects to OpenAI's LLM models to generate AI images and mint them on the Flow blockchain. This app integrates AI with blockchain technology.\n My role involved the app's development, focusing on integrating OpenAI's models for image generation and ensuring smooth functionality with the Flow blockchain.",
    "technologies": [
      "Next.js",
      "Flow",
      "Niftory",
      "Dalle",
      "Midjourney",
      "OpenAI",
      "Tailwind",
      "Blockchain",
      "NFT"
    ],
    "tags": ["ai", "web3", "hackathon"],
    "link": "https://wizart.world",
    "image": "https://gaboesquivel.com/images/work/wizart-world.png",
    "video": "https://www.youtube.com/watch?v=I_vBUflXHFA",
    "repo": "https://github.com/bitcashorg/wizartworld",
    "achievements": [
      "Developed a progressive web app integrating AI-generated images with blockchain minting.",
      "Implemented OpenAI's LLM models for AI-driven image creation and metadata processing.",
      "Integrated the Flow blockchain for seamless NFT minting and storage."
    ],
    "story": [
      "Wizard World was developed as part of the Flow Hackathon 2022 with the Bitlauncher team. The project aimed to integrate AI with blockchain technology by creating a progressive web app that connects to OpenAI's LLM models to generate AI images and mint them on the Flow blockchain.",
      "My role involved the app's development, focusing on integrating OpenAI's models for image generation and ensuring smooth functionality with the Flow blockchain. This integration allowed for the seamless creation and minting of NFTs, providing users with a unique digital experience.",
      "The project showcased the potential of combining AI and blockchain technologies, offering innovative solutions for digital content creation and distribution. Wizard World stands as a testament to the collaborative efforts of the Bitlauncher team and the innovative possibilities within the AI and blockchain spaces."
    ]
  },

  {
    "title": "dBoard",
    "slug": "dboard",
    "description": "dBoard is a DAO decision-making and community management tool. It allows stakeholders to strategize, debate, and vote on actions for organizational efficiency.\n In this project, my contributions included overseeing the technical architecture and the smart contract development and integration on the webapp.",
    "technologies": ["Antelope", "Next.js", "GCloud", "GraphQL"],
    "tags": ["web3"],
    "link": "https://eos.dboard.ai",
    "image": "https://gaboesquivel.com/images/work/dboard.png",
    "repo": "https://github.com/bitcashorg/bitcash-contract-dho",
    "achievements": [
      "Led the technical architecture for DAO governance and decision-making.",
      "Developed and integrated smart contracts to enhance community voting mechanisms.",
      "Implemented a seamless GraphQL API for improved data interactions."
    ],
    "story": [
      "dBoard was developed as a comprehensive tool for DAO decision-making and community management, designed to empower stakeholders with the ability to strategize, debate, and vote on organizational actions. My role in the project was pivotal, as I oversaw the technical architecture and the development of smart contracts that facilitated these processes.",
      "The platform leverages Antelope and Next.js to provide a robust and scalable environment for decentralized governance. By integrating smart contracts, we ensured that community voting mechanisms were secure and transparent, fostering trust and engagement among users.",
      "Through the implementation of a seamless GraphQL API, dBoard offers improved data interactions, allowing stakeholders to access and analyze information efficiently. This project reflects my commitment to advancing DAO technologies and creating tools that enhance organizational efficiency and community collaboration."
    ]
  },
  {
    "title": "Wink",
    "slug": "wink",
    "description": "Wink, Costa Rica's first neo-bank, offers a mobile app for online banking, eliminating the need for physical branch visits.\n I developed the first version of Wink's mobile app and backend services within AWS. My role involved API integration with partner banks and forming a dedicated development team.",
    "technologies": [
      "AWS",
      "Serverless",
      "React Native",
      "React",
      "Node.js",
      "Biometrics"
    ],
    "tags": ["full-time", "lead"],
    "link": "https://holawink.com",
    "image": "https://gaboesquivel.com/images/work/wink.png",
    "video": "https://www.youtube.com/watch?v=rfeISMW_OVc",
    "achievements": [
      "Developed the first version of Wink's mobile banking app.",
      "Integrated API connections with partner banks for seamless transactions.",
      "Designed and implemented biometric authentication for enhanced security."
    ],
    "story": [
      "Wink was developed as Costa Rica's first neo-bank, aiming to revolutionize the banking experience by offering a fully digital platform. My role was crucial in developing the first version of Wink's mobile app and backend services, leveraging AWS for a scalable and secure infrastructure.",
      "I was responsible for the technology selection, project planning, and coordination with partner banks, ensuring seamless and efficient transactions for users. Additionally, I implemented biometric authentication to enhance security, providing users with a safe and convenient banking experience.",
      "The project involved forming a dedicated development team, focusing on innovation and user-centric design. Wink's success reflects my commitment to leveraging technology to create impactful solutions in the financial sector, transforming traditional banking into a modern, digital experience."
    ]
  },
  {
    "title": "American Express",
    "slug": "american-express",
    "description": "The American Express website enables cardmembers to manage their financial accounts, offering features like balance checks, transaction views, and secure payments.\n My responsibility was focused on front-end development, including Object-Oriented JavaScript, AJAX for a fluid user experience, and implementing A/B Testing and usage analytics.",
    "image": "https://gaboesquivel.com/images/work/amex.jpg",
    "link": "https://www.americanexpress.com/",
    "technologies": [
      "JSP (Struts)",
      "Omniture",
      "Adobe mBox",
      "Facebook API",
      "Dojo",
      "jQuery",
      "CSS"
    ],
    "tags": ["full-time"],
    "achievements": [
      "Enhanced user experience through AJAX-driven interactivity.",
      "Implemented A/B testing strategies to optimize user engagement.",
      "Developed analytics integrations to track usage and improve performance."
    ],
    "story": [
      "At American Express, I was responsible for enhancing the front-end of their website, which serves as a critical tool for cardmembers to manage their financial accounts. My work involved using Object-Oriented JavaScript and AJAX to create a fluid and interactive user experience.",
      "I implemented A/B testing strategies to optimize user engagement and integrated analytics tools to track usage and improve performance. This role required a deep understanding of user behavior and the ability to translate that into effective design and functionality.",
      "The project was a significant opportunity to work with a leading financial services company, and it allowed me to contribute to a platform that millions of users rely on daily. My contributions helped improve the overall user experience, making it easier and more intuitive for cardmembers to manage their accounts online."
    ]
  },

  {
    "title": "AMEX Money Talk",
    "slug": "amex-money-talk",
    "description": "The National Money Night Talk by American Express aimed to promote financial communication between parents and teenagers.\n As a Frontend Engineer, I developed the campaign's landing page, focusing on user engagement and information delivery.",
    "link": "https://www.youtube.com/watch?v=a2vDoYyXIJQ",
    "image": "https://gaboesquivel.com/images/work/money-talk.jpg",
    "technologies": ["JavaScript", "CSS"],
    "tags": ["other"],
    "achievements": [
      "Developed an engaging landing page to enhance user interaction.",
      "Implemented responsive design for a seamless experience across devices.",
      "Optimized page performance to improve load times and accessibility."
    ],
    "story": [
      "The AMEX Money Talk campaign was designed to encourage open financial communication between parents and teenagers. As a Frontend Engineer, I was tasked with developing the campaign's landing page, which needed to be both engaging and informative.",
      "My focus was on creating a user-friendly interface that facilitated easy navigation and interaction. By implementing responsive design techniques, I ensured that the page provided a seamless experience across various devices, enhancing accessibility and user engagement.",
      "The project was an opportunity to contribute to a meaningful initiative that aimed to improve financial literacy and communication within families. My work on the landing page helped to effectively convey the campaign's message and encourage participation."
    ]
  },
  {
    "title": "Elder Scrolls Online",
    "slug": "elder-scrolls-online",
    "description": "The official website serves as a central hub for a gaming community, offering news, game guides, and forums.\n My role was to ensure a user-centric design for the website, facilitating easy navigation and engagement with the content, blending aesthetics and functionality for a dynamic digital platform.",
    "technologies": [
      "PHP",
      "JavaScript",
      "jQuery",
      "Facebook API",
      "Twitter API"
    ],
    "tags": ["contract"],
    "link": "http://elderscrollsonline.com",
    "image": "https://gaboesquivel.com/images/work/elder-scrolls.jpg",
    "achievements": [
      "Designed and implemented a user-centric website for the gaming community.",
      "Optimized site navigation for a seamless user experience.",
      "Integrated social media features to enhance community engagement."
    ],
    "story": [
      "The Elder Scrolls Online website was developed to serve as a central hub for the game's community, providing players with access to news, game guides, and forums. My role was to ensure that the website's design was user-centric, facilitating easy navigation and engagement with the content.",
      "I focused on blending aesthetics and functionality to create a dynamic digital platform that met the needs of the gaming community. By optimizing site navigation and integrating social media features, I enhanced the overall user experience and community engagement.",
      "This project was an exciting opportunity to work within the gaming industry, allowing me to contribute to a platform that supports a vibrant and active community. My work helped to create a welcoming and informative online space for players to connect and share their experiences."
    ]
  },
  {
    "title": "AMC Yeah TV Facebook App",
    "slug": "amc-yeah-tv-facebook-app",
    "description": "An online movie streaming service allows watching movies in chapters with detailed information and interactive games.\n I was responsible for the frontend architecture design, integrating the game app with Facebook and the backoffice system with Brightcove web services for video streaming and editing.",
    "technologies": [
      "HTML5",
      "PHP",
      "Facebook API",
      "AJAX",
      "Facebook Credits",
      "Handlebars",
      "Brightcove API",
      "require.js"
    ],
    "tags": ["full-time", "lead"],
    "link": "http://yeahtv.com",
    "image": "https://gaboesquivel.com/images/work/yeahtv.jpg",
    "achievements": [
      "Designed and built a scalable frontend architecture for an interactive movie experience.",
      "Integrated Brightcove video streaming API for seamless movie playback.",
      "Implemented Facebook API features for user engagement and monetization."
    ],
    "story": [
      "The AMC Yeah TV Facebook App was developed as an innovative online movie streaming service, allowing users to watch movies in chapters with detailed information and interactive games. My role was to design the frontend architecture and integrate the app with Facebook and Brightcove web services.",
      "I focused on creating a scalable and interactive platform that enhanced user engagement through seamless video playback and social media integration. By leveraging the Brightcove API, I ensured high-quality streaming and editing capabilities.",
      "This project was a unique opportunity to blend entertainment with technology, providing users with an engaging and interactive movie-watching experience. My contributions helped to create a dynamic platform that combined the best of social media and streaming services."
    ]
  },
  {
    "title": "Tikr",
    "slug": "tikr",
    "description": "Tikr is an online store with dynamic, real-time fluctuating prices, offering a unique shopping experience. It operates on the Ruby on Rails-based Spree backend framework.\n My role at Tikr encompassed full-stack development with a focus on frontend development and customization of the Spree backend framework.",
    "link": "http://tikr.com",
    "image": "https://gaboesquivel.com/images/work/tikr.jpg",
    "tags": ["contract"],
    "technologies": [
      "Ruby on Rails",
      "Spree",
      "Heroku",
      "Postgres",
      "jQuery",
      "SASS/SCSS"
    ],
    "achievements": [
      "Developed a dynamic pricing engine using Spree and Ruby on Rails.",
      "Implemented a real-time price fluctuation system for enhanced user engagement.",
      "Optimized backend performance on Heroku with PostgreSQL integration."
    ],
    "story": [
      "Tikr was developed as an innovative online store that offered a unique shopping experience through dynamic, real-time fluctuating prices. My role involved full-stack development, with a particular focus on frontend development and customization of the Spree backend framework.",
      "I developed a dynamic pricing engine using Spree and Ruby on Rails, which allowed for real-time price fluctuations, enhancing user engagement and creating a more interactive shopping experience.",
      "The project also involved optimizing backend performance on Heroku with PostgreSQL integration, ensuring a robust and scalable platform. Tikr's success reflects my ability to deliver innovative solutions that enhance user experience and engagement in the e-commerce space."
    ]
  },
  {
    "title": "Eat Arcade",
    "slug": "eat-arcade",
    "description": "I designed and developed an SMS subscription system featuring curated dishes from New York City's finest restaurants. The system offered a unique dining experience through mobile technology.\n My responsibilities covered the entire development process, from system design to implementation.",
    "technologies": [
      "Node.js",
      "Express.js",
      "AngularJS",
      "MongoDB",
      "Heroku",
      "Bootstrap",
      "Stripe",
      "Twilio"
    ],
    "tags": ["contract"],
    "link": "http://www.eatarcade.com/",
    "image": "https://gaboesquivel.com/images/work/eatarcade.jpg",
    "achievements": [
      "Designed and built an SMS-based subscription system for restaurant promotions.",
      "Integrated Twilio for seamless messaging and user engagement.",
      "Developed a full-stack solution using Node.js, MongoDB, and AngularJS."
    ],
    "story": [
      "Eat Arcade was developed as an innovative SMS subscription system that featured curated dishes from New York City's finest restaurants. My role encompassed the entire development process, from system design to implementation, ensuring a seamless and engaging user experience.",
      "I designed and built the system using Node.js, Express.js, and AngularJS, integrating Twilio for seamless messaging and user engagement. This allowed users to receive curated dining options directly to their mobile devices, enhancing their dining experience.",
      "The project also involved integrating Stripe for payment processing and deploying the solution on Heroku for scalability. Eat Arcade reflects my ability to create innovative solutions that leverage mobile technology to enhance user engagement and experience in the dining industry."
    ]
  },
  {
    "title": "Jockey Hollow Bar and Kitchen",
    "slug": "jockey-hollow-bar-and-kitchen",
    "description": "Jockey Hollow Bar and Kitchen, located in a historic mansion, features four distinct dining concepts. The responsive landing page I developed introduces visitors to its diverse culinary world.\n My work focused on developing the main responsive landing page, ensuring an inviting and informative digital gateway to the restaurant's offerings.",
    "technologies": [
      "SASS",
      "jQuery",
      "Lodash",
      "Grapnel.js",
      "Grunt",
      "Node.js (Express)",
      "Heroku",
      "Divshot"
    ],
    "tags": ["contract"],
    "link": "http://www.jockeyhollowbarandkitchen.com/",
    "image": "https://gaboesquivel.com/images/work/jockey-hollow.png",
    "achievements": [
      "Developed a fully responsive landing page with a focus on user experience.",
      "Optimized page speed and performance for seamless navigation.",
      "Integrated dynamic content features to showcase the restaurant's offerings effectively."
    ],
    "story": [
      "Jockey Hollow Bar and Kitchen is a unique dining destination located in a historic mansion, offering four distinct dining concepts. My role was to develop a responsive landing page that would serve as an inviting and informative digital gateway to the restaurant's diverse culinary offerings.",
      "I focused on creating a user-friendly interface that highlighted the restaurant's unique features and dining options. By optimizing page speed and performance, I ensured that visitors could easily navigate the site and explore the restaurant's offerings.",
      "The project involved integrating dynamic content features to effectively showcase the restaurant's menu and events. My work on the landing page helped to create an engaging online presence that reflects the restaurant's commitment to quality and innovation in the dining industry."
    ]
  },

  {
    "title": "Jockey Hollow Bar and Kitchen Menu Kiosk App",
    "slug": "jockey-hollow-bar-and-kitchen-menu-kiosk-app",
    "description": "At Jockey Hollow Bar & Kitchen, I developed the Menu Kiosk App, a responsive web application for tablet kiosks. It simplifies menu selection for patrons and uses Google Spreadsheets for easy updates.\n As the sole developer, my role involved creating an intuitive and efficient digital menu solution, enhancing the dining experience.",
    "technologies": [
      "SASS",
      "jQuery",
      "Lodash",
      "Grapnel.js",
      "Grunt",
      "Node.js (Express)",
      "Heroku",
      "Divshot"
    ],
    "tags": ["contract"],
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/jockey-hollow-menu.png",
    "achievements": [
      "Developed a user-friendly menu kiosk app to enhance restaurant service.",
      "Integrated Google Spreadsheets for seamless menu updates.",
      "Optimized app performance for smooth operation on tablet devices."
    ],
    "story": [
      "The Jockey Hollow Bar and Kitchen Menu Kiosk App was developed to enhance the dining experience by providing a digital menu solution for patrons. As the sole developer, I created a responsive web application designed for tablet kiosks, simplifying menu selection and improving service efficiency.",
      "The app integrates with Google Spreadsheets, allowing for easy and real-time menu updates, which ensures that the information is always current and accurate. This feature was crucial for maintaining the dynamic nature of the restaurant's offerings.",
      "By focusing on intuitive design and performance optimization, the Menu Kiosk App provides a seamless and engaging user experience, reflecting the restaurant's commitment to innovation and customer satisfaction."
    ]
  },
  {
    "title": "Bureau of Trade (Beta)",
    "slug": "bureau-of-trade-beta",
    "description": "Bureau of Trade (Beta) is an online store offering a range of products, with a frontend integrated with eBay's API for diverse shopping experiences.\n As the sole Fullstack developer, my focus was on frontend development, responsive design, and animations, along with eBay API integration.",
    "link": "http://www.gridium.com/products/portfolio-manager/",
    "image": "https://gaboesquivel.com/images/work/bureau-of-trade.jpg",
    "technologies": ["PHP", "eBay API", "HTML5", "AJAX", "jQuery"],
    "tags": ["contract"],
    "achievements": [
      "Built a responsive e-commerce frontend integrated with eBay's API.",
      "Developed advanced UI animations for enhanced user experience.",
      "Optimized site performance for faster product browsing."
    ],
    "story": [
      "Bureau of Trade (Beta) was developed as an innovative online store offering a diverse range of products. As the sole Fullstack developer, I focused on creating a responsive and engaging frontend integrated with eBay's API to provide a seamless shopping experience.",
      "I implemented advanced UI animations to enhance user interaction and engagement, ensuring that the platform was both visually appealing and functional. The integration with eBay's API allowed for a wide variety of products to be available to users, enhancing the overall shopping experience.",
      "The project involved optimizing site performance to ensure fast and efficient product browsing, reflecting my commitment to delivering high-quality and user-centric e-commerce solutions. Bureau of Trade (Beta) stands as a testament to my ability to integrate complex APIs and create dynamic online shopping platforms."
    ]
  },
  {
    "title": "Tractor Supply",
    "slug": "tractor-supply",
    "description": "The Tractor Supply mobile app offers features like product browsing, exclusive offers, account management, and an augmented reality feature for product previews.\n As a consultant, I enhanced the app's performance and code quality, and developed its augmented reality feature, improving user experience and engagement.",
    "technologies": [
      "React Native",
      "React",
      "Node.js",
      "TypeScript",
      "Augmented Reality"
    ],
    "tags": ["contract"],
    "link": "https://www.tractorsupply.com/tsc/cms/app",
    "image": "https://gaboesquivel.com/images/work/tractor-supply.png",
    "achievements": [
      "Enhanced app performance and code quality for a smoother user experience.",
      "Developed an augmented reality feature to preview products interactively.",
      "Implemented TypeScript for improved maintainability and scalability."
    ],
    "story": [
      "At Tractor Supply, I worked on enhancing the mobile app's performance and code quality. My primary focus was on improving the user experience and engagement. As a consultant, I played a key role in developing the augmented reality feature for product previews, which significantly enhanced the app's functionality and appeal.",
      "Throughout the project, I implemented TypeScript to improve code maintainability and scalability. This decision ensured that the app would remain up-to-date and adaptable to future changes. My contributions to Tractor Supply reflect my commitment to delivering high-quality and innovative solutions."
    ]
  },
  {
    "title": "Photo and Go",
    "slug": "photo-and-go",
    "description": "MyPhoto.com is an online platform for creating personalized photo products. I led the development of an innovative photo editor app and backend services integrated with existing e-commerce systems.\n My leadership role encompassed technical direction and execution, focusing on creating a smooth and intuitive user experience.",
    "technologies": [
      "React",
      "Node.js",
      "Hapi",
      "Swagger",
      "Redux",
      "AWS",
      "Docker",
      "Jenkins",
      "PostgreSQL",
      "Linux"
    ],
    "tags": ["contract"],
    "link": "https://www.myphoto.com/",
    "image": "https://gaboesquivel.com/images/work/photoandgo.jpg",
    "achievements": [
      "Developed a photo editor app with seamless e-commerce integration.",
      "Led technical execution, ensuring a smooth and intuitive user experience.",
      "Implemented AWS infrastructure for scalable cloud storage and processing."
    ],
    "story": [
      "MyPhoto.com is an online platform that allows users to create personalized photo products. As a leader in the development of this project, I took on the challenge of building an innovative photo editor app and backend services integrated with existing e-commerce systems.",
      "My role encompassed technical direction and execution, with a primary focus on creating a smooth and intuitive user experience. Throughout the project, I led the development of the photo editor app, ensuring seamless e-commerce integration. Additionally, I implemented AWS infrastructure for scalable cloud storage and processing, enhancing the platform's capabilities.",
      "My contributions to Photo and Go reflect my dedication to delivering high-quality and user-centric solutions. The project showcases my ability to lead technical execution and create innovative digital experiences."
    ]
  },
  {
    "title": "4Tius Fitness Data Tracker",
    "slug": "4tius-fitness-data-tracker",
    "description": "The 4Tius app is a centralized platform for monitoring fitness data, integrating with Fitbit. It includes a web dashboard and API.\n As a Fullstack software engineer, I led the development of both the web application and backend systems, ensuring seamless integration and user-friendly functionality.",
    "technologies": [
      "Node.js",
      "Express",
      "AWS",
      "Linux",
      "MongoDB",
      "Angular.js"
    ],
    "tags": ["contract"],
    "link": "https://example.com/18techs",
    "image": "https://gaboesquivel.com/images/work/4tius.jpg",
    "achievements": [
      "Designed and developed a fitness data tracking system with Fitbit integration.",
      "Built a responsive web dashboard for real-time analytics and monitoring.",
      "Implemented secure API endpoints for efficient data communication."
    ],
    "story": [
      "The 4Tius Fitness Data Tracker was developed as a centralized platform for monitoring fitness data, integrating seamlessly with Fitbit devices. As a Fullstack software engineer, I led the development of both the web application and backend systems, ensuring that the platform was both user-friendly and highly functional.",
      "I focused on designing a responsive web dashboard that provided real-time analytics and monitoring capabilities, allowing users to track their fitness progress effectively. The integration with Fitbit ensured that data was accurate and up-to-date, providing users with valuable insights into their fitness routines.",
      "Additionally, I implemented secure API endpoints to facilitate efficient data communication between the app and Fitbit devices. This project reflects my commitment to creating innovative solutions that enhance user experience and promote healthy living through technology."
    ]
  },
  {
    "title": "SunTrust",
    "slug": "suntrust",
    "description": "SunTrust's Solid Salutes campaign facilitated user-generated custom video salutes. I developed the entire campaign website, focusing on design and user interaction.\n My role included overseeing the website's development from concept to implementation, emphasizing user engagement and visual appeal.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/suntrust-1.jpg",
    "technologies": ["JavaScript", "CSS"],
    "tags": ["other"],
    "achievements": [
      "Developed an interactive campaign website for user-generated content.",
      "Optimized website performance for increased user engagement.",
      "Implemented visually appealing UI/UX elements to enhance storytelling."
    ],
    "story": [
      "The SunTrust Solid Salutes campaign was designed to allow users to create custom video salutes, fostering a sense of community and appreciation. I was responsible for developing the entire campaign website, focusing on creating an engaging and interactive user experience.",
      "My role involved overseeing the website's development from concept to implementation, ensuring that the design was visually appealing and that user interaction was seamless. By optimizing website performance, I enhanced user engagement and ensured that the platform could handle high traffic volumes.",
      "The project was an opportunity to contribute to a meaningful campaign that celebrated community and connection. My work on the website helped to effectively convey the campaign's message and encourage participation, reflecting my commitment to creating impactful digital experiences."
    ]
  },

  {
    "title": "ScotiaTico",
    "slug": "scotiatico",
    "description": "For ScotiaBank Costa Rica, I developed the ScotiaTico newsletter, a communication tool for bank updates and information.\n My responsibility was crafting an engaging and informative newsletter layout, enhancing communication between the bank and its customers.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/scotiatico.jpg",
    "technologies": ["JavaScript", "CSS", "Wordpress"],
    "tags": ["other"],
    "achievements": [
      "Designed and developed an interactive newsletter layout for ScotiaBank.",
      "Enhanced customer engagement with visually appealing and responsive design.",
      "Implemented Wordpress CMS for easy content management and updates."
    ],
    "story": [
      "The ScotiaTico newsletter was developed for ScotiaBank Costa Rica as a communication tool to keep customers informed about bank updates and information. This project was undertaken while I was at IntergraphiDesign, my first job at a development shop.",
      "My responsibility was to craft an engaging and informative newsletter layout that would enhance communication between the bank and its customers. By focusing on visually appealing and responsive design, I was able to enhance customer engagement and ensure that the newsletter was accessible across various devices.",
      "I implemented a Wordpress CMS to facilitate easy content management and updates, ensuring that the bank could efficiently manage the newsletter's content. This project was a valuable experience in my early career, allowing me to apply my skills in a real-world setting and contribute to effective communication strategies for a major financial institution."
    ]
  },
  {
    "title": "Staples",
    "slug": "staples",
    "description": "At Staples, a retail store for office supplies, I worked on building responsive features and the main website navigation.\n My role as a frontend developer involved creating user-friendly and efficient navigation elements, contributing to the overall user experience on the website.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/staples.jpg",
    "technologies": ["JavaScript", "CSS", "Mootols"],
    "tags": ["other"],
    "achievements": [
      "Developed responsive UI components for improved website accessibility.",
      "Enhanced navigation for a seamless shopping experience.",
      "Optimized front-end performance for faster load times."
    ],
    "story": [
      "The Staples project was a freelance job where I was tasked with enhancing the website's user experience by developing responsive features and improving the main navigation. As a frontend developer, my focus was on creating user-friendly and efficient navigation elements that contributed to a seamless shopping experience.",
      "I worked on developing responsive UI components that improved website accessibility, ensuring that users could easily navigate the site across various devices. By optimizing front-end performance, I was able to reduce load times and enhance the overall user experience.",
      "This freelance project allowed me to apply my skills in a real-world setting, contributing to a major retail store's online presence. It was a valuable experience that showcased my ability to deliver high-quality and user-centric solutions."
    ]
  },
  {
    "title": "Gridium",
    "slug": "gridium",
    "description": "Gridium is an energy data analytics prototype for visualizing and analyzing energy consumption. It aids in informed energy management decisions.\n I built the first version of the application, focusing on displaying data collected from various buildings.",
    "link": "https://gridium.com/",
    "image": "https://gaboesquivel.com/images/work/gridium.png",
    "technologies": ["JavaScript", "Data Charts", "CSS", "Bootstrap"],
    "tags": ["contract"],
    "achievements": [
      "Developed a data visualization platform for energy consumption analytics.",
      "Implemented interactive charts for real-time energy monitoring.",
      "Optimized UI/UX for better readability and user engagement."
    ],
    "story": [
      "The Gridium project was a freelance job where I was responsible for developing an energy data analytics prototype. The application was designed to visualize and analyze energy consumption data, aiding in informed energy management decisions.",
      "I built the first version of the application, focusing on displaying data collected from various buildings. This involved developing a data visualization platform that included interactive charts for real-time energy monitoring.",
      "The project required optimizing the UI/UX for better readability and user engagement, ensuring that users could easily interpret and act on the data presented. This freelance opportunity allowed me to apply my skills in data visualization and user interface design, contributing to a tool that supports sustainable energy management."
    ]
  },

  {
    "title": "ARINC Microfids",
    "slug": "arinc-microfids",
    "description": "ARINC Microfids is a flight information display system for hotels and airport businesses. It integrates with a Ruby on Rails backend.\n My responsibilities included frontend development and system integration, ensuring a seamless display of flight information.",
    "image": "https://gaboesquivel.com/images/work/arinc.png",
    "technologies": ["Ruby on Rails", "AngularJS", "Faye", "LESS", "Heroku"],
    "tags": ["contract"],
    "achievements": [
      "Developed a real-time flight information display system.",
      "Integrated Ruby on Rails backend with AngularJS for seamless data updates.",
      "Optimized front-end performance for real-time user interaction."
    ],
    "story": [
      "The ARINC Microfids project was a freelance job where I was tasked with developing a flight information display system for hotels and airport businesses. The system was designed to provide real-time flight information, enhancing the travel experience for users.",
      "My responsibilities included frontend development and system integration, ensuring that the display system was both user-friendly and efficient. I integrated the Ruby on Rails backend with AngularJS to enable seamless data updates and real-time user interaction.",
      "This project allowed me to apply my skills in frontend development and system integration, contributing to a tool that supports the travel industry by providing accurate and timely flight information."
    ]
  },
  {
    "title": "Capoeira Abolicao",
    "slug": "capoeira-abolicao",
    "description": "Capoeira Abolio is a Brazilian martial arts group. I volunteered to create their promotional website, showcasing their professors and community.\n My involvement included website design and development, highlighting the group's activities and global presence.",
    "link": "https://capoieraabolicao.com",
    "image": "https://gaboesquivel.com/images/work/abolicao.jpg",
    "technologies": ["JavaScript", "Wordpress", "CSS", "Bootstrap"],
    "tags": ["other"],
    "achievements": [
      "Designed and developed a responsive website for Capoeira Abolio.",
      "Implemented interactive elements to showcase community events.",
      "Optimized site performance for a seamless user experience."
    ],
    "story": [
      "While living in Miami, I trained Capoeira with Mestre Delei, becoming deeply involved with the Capoeira Abolio group. As a gesture of appreciation and to support the community, I volunteered to create a promotional website at no cost. This project allowed me to merge my technical skills with my passion for Capoeira, providing a digital platform to showcase the group's activities and the rich cultural heritage of Capoeira.",
      "The website was crafted using technologies like JavaScript, Wordpress, CSS, and Bootstrap, ensuring it was both responsive and engaging. My aim was to create an online presence that captured the energy and spirit of our group. By incorporating interactive elements, the site effectively highlighted community events and the unique aspects of Capoeira, serving as a valuable resource for both members and those interested in joining.",
      "This project was a meaningful part of my journey, as it allowed me to contribute to a community that had given me so much. It was a rewarding experience that not only enhanced my web development skills but also strengthened my connection to the Capoeira community. The website continues to serve as a testament to the group's activities and global presence, fostering a sense of unity and cultural exchange."
    ]
  },
  {
    "title": "Panini",
    "slug": "panini",
    "description": "Panini, a project I worked on, provided a unique service or product in its field.\n My role in this project was focused on technical development and implementation.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/panini.jpg",
    "technologies": ["JavaScript", "CSS", "Wordpress"],
    "tags": ["other"],
    "achievements": [
      "Developed and implemented the technical architecture for Panini's platform.",
      "Optimized website performance and ensured cross-browser compatibility.",
      "Enhanced UI/UX for a smooth and intuitive user experience."
    ],
    "story": [
      "The Panini project was a freelance opportunity where I was responsible for the technical development and implementation of a unique service or product. My role involved designing and implementing the technical architecture to ensure the platform was robust and efficient.",
      "I focused on optimizing website performance and ensuring cross-browser compatibility, which was crucial for providing a seamless user experience. By enhancing the UI/UX, I aimed to create a smooth and intuitive interface that would engage users effectively.",
      "This freelance project allowed me to apply my technical skills in a real-world setting, contributing to a platform that offered a distinctive service or product. It was a valuable experience that showcased my ability to deliver high-quality and user-centric solutions."
    ]
  },
  {
    "title": "Earth",
    "slug": "earth",
    "description": "EARTH University offers education in agricultural sciences. I was responsible for building their main website, blog, and newsletter.\n My work involved creating a digital platform for information dissemination and community engagement, focusing on usability and content management.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/wordpress-earth-pai.jpg",
    "technologies": ["JavaScript", "CSS", "Wordpress"],
    "tags": ["other"],
    "achievements": [
      "Developed a content management system for EARTH University's website.",
      "Designed a responsive and accessible blog for community engagement.",
      "Implemented newsletter automation for improved communication."
    ],
    "story": [
      "The EARTH University project was undertaken while I was at IntergraphiDesign, my first job at a development shop. The university offers education in agricultural sciences, and I was responsible for building their main website, blog, and newsletter.",
      "My work involved creating a digital platform for information dissemination and community engagement, focusing on usability and content management. I developed a content management system that allowed for easy updates and management of the university's online presence.",
      "By designing a responsive and accessible blog, I enhanced community engagement and ensured that the university's content was accessible to a wide audience. Implementing newsletter automation further improved communication, allowing the university to efficiently reach its stakeholders. This project was a valuable experience in my early career, allowing me to apply my skills in a real-world setting and contribute to the university's mission of education and community involvement."
    ]
  },
  {
    "title": "Proparques",
    "slug": "proparques",
    "description": "ProParques is a nonprofit for national park sustainability. I developed their responsive landing page and an interactive national park map.\n My role included web design and development, focusing on user interaction and information accessibility for park exploration.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/proparques.jpg",
    "technologies": ["JavaScript", "CSS", "Wordpress"],
    "tags": ["other"],
    "achievements": [
      "Developed an interactive national park map for user exploration.",
      "Designed a responsive and informative landing page.",
      "Integrated user-friendly navigation for enhanced accessibility."
    ],
    "story": [
      "The ProParques project was undertaken while I was at IntergraphiDesign, my first job at a development shop. ProParques is a nonprofit organization focused on national park sustainability, and I was responsible for developing their responsive landing page and an interactive national park map.",
      "My role included web design and development, with a focus on user interaction and information accessibility for park exploration. I developed an interactive map that allowed users to explore various national parks, enhancing their understanding and appreciation of these natural resources.",
      "By designing a responsive and informative landing page, I ensured that the website was accessible and engaging for users. This project was a valuable experience in my early career, allowing me to apply my skills in a real-world setting and contribute to the mission of promoting national park sustainability."
    ]
  },
  {
    "title": "Fantasy Tennis",
    "slug": "fantasy-tennis",
    "description": "FanSlam Fantasy Tennis is a strategic game for ATP, WTA, and Grand Slam tournaments. I designed and built both the frontend and backend.\n As a fullstack developer, my work encompassed creating an engaging and functional gaming experience, integrating strategy and user interface design.",
    "link": "https://www.fanslam.us",
    "image": "https://gaboesquivel.com/images/work/fantasy-tennis.jpg",
    "technologies": ["JavaScript", "CSS"],
    "tags": ["contract"],
    "achievements": [
      "Designed and developed a strategic fantasy tennis gaming platform.",
      "Built a responsive UI for seamless gameplay across devices.",
      "Integrated dynamic tournament data for real-time game updates."
    ],
    "story": [
      "The Fantasy Tennis project was a freelance opportunity where I was responsible for designing and building both the frontend and backend of a strategic game for ATP, WTA, and Grand Slam tournaments. As a fullstack developer, my work encompassed creating an engaging and functional gaming experience, integrating strategy and user interface design.",
      "I focused on building a responsive UI that allowed for seamless gameplay across devices, ensuring that users could enjoy the game on any platform. By integrating dynamic tournament data, I enabled real-time game updates, enhancing the overall user experience.",
      "This freelance project allowed me to apply my skills in game development and user interface design, contributing to a platform that offered a unique and engaging experience for tennis fans. It was a valuable experience that showcased my ability to deliver high-quality and user-centric solutions."
    ]
  },

  {
    "title": "Mobtion",
    "slug": "mobtion",
    "description": "Mobtion agency specializes in mobile development services. I designed and developed their responsive website and WordPress CMS.\n My responsibilities included website design, development, and ensuring seamless content management for the agency.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/mobtion.jpg",
    "technologies": ["JavaScript", "CSS", "Wordpress", "PHP"],
    "tags": ["other"],
    "achievements": [
      "Developed a responsive and modern website for Mobtion agency.",
      "Integrated WordPress CMS for efficient content management.",
      "Optimized website performance for improved loading speeds."
    ],
    "story": [
      "The Mobtion project was undertaken while I was at IntergraphiDesign, my first job at a development shop. Mobtion agency specializes in mobile development services, and I was responsible for designing and developing their responsive website and WordPress CMS.",
      "My responsibilities included website design, development, and ensuring seamless content management for the agency. I focused on creating a modern and responsive website that effectively showcased Mobtion's services and capabilities.",
      "By integrating a WordPress CMS, I facilitated efficient content management, allowing the agency to easily update and manage their online presence. This project was a valuable experience in my early career, allowing me to apply my skills in a real-world setting and contribute to the agency's digital strategy."
    ]
  },
  {
    "title": "ITS",
    "slug": "its",
    "description": "ITS InfoCom, an IT multinational, focuses on Remote Infrastructure Management. I implemented their primary website, CMS, and CRM integration.\n My role was to create and integrate digital solutions for the company, focusing on web presence and customer relationship management.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/website-its.jpg",
    "technologies": ["JavaScript", "CSS", "PHP", "Custom CMS"],
    "tags": ["other"],
    "achievements": [
      "Developed and deployed a company-wide CMS for ITS InfoCom.",
      "Integrated CRM solutions to streamline customer interactions.",
      "Optimized website architecture for scalability and security."
    ],
    "story": [
      "The ITS project was undertaken while I was at IntergraphiDesign, my first job at a development shop. ITS InfoCom is an IT multinational that focuses on Remote Infrastructure Management, and I was responsible for implementing their primary website, CMS, and CRM integration.",
      "My role was to create and integrate digital solutions for the company, focusing on enhancing their web presence and customer relationship management. I developed and deployed a company-wide CMS that facilitated efficient content management and updates.",
      "By integrating CRM solutions, I streamlined customer interactions, ensuring that the company could effectively manage and engage with their clients. This project was a valuable experience in my early career, allowing me to apply my skills in a real-world setting and contribute to the company's digital strategy."
    ]
  },
  {
    "title": "Trivenzor",
    "slug": "trivenzor",
    "description": "For Trivenzor, a hypertension medication, I developed a responsive landing page for patient and healthcare provider information.\n My work involved creating a user-friendly and informative digital platform, emphasizing medical information clarity and accessibility.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/tribenzor.jpg",
    "technologies": ["JavaScript", "CSS", "Mootols"],
    "tags": ["other"],
    "achievements": [
      "Developed a fully responsive and accessible medical landing page.",
      "Ensured clarity and usability for both patients and healthcare providers.",
      "Optimized page speed and performance for better user engagement."
    ],
    "story": [
      "The Trivenzor project was a freelance opportunity where I was responsible for developing a responsive landing page for a hypertension medication. My work involved creating a user-friendly and informative digital platform, emphasizing medical information clarity and accessibility.",
      "I focused on ensuring that the landing page was fully responsive and accessible, providing clear and usable information for both patients and healthcare providers. By optimizing page speed and performance, I enhanced user engagement and ensured that the platform was efficient and effective.",
      "This freelance project allowed me to apply my skills in web development and user experience design, contributing to a platform that provided valuable medical information to its users."
    ]
  },
  {
    "title": "Living with Dryness",
    "slug": "living-with-dryness",
    "description": "The Living with Dryness project involved crafting a responsive landing page focused on providing information and resources.\n As the developer, I ensured a pixel-perfect design and user-friendly navigation, catering to the project's specific audience and needs.",
    "link": "#",
    "image": "https://gaboesquivel.com/images/work/living-with-dryness.jpg",
    "technologies": ["JavaScript", "CSS", "Wordpress"],
    "tags": ["other"],
    "achievements": [
      "Designed and developed a responsive landing page for medical resources.",
      "Implemented a user-friendly navigation system for better accessibility.",
      "Optimized website layout for enhanced readability and engagement."
    ],
    "story": [
      "The Living with Dryness project was a freelance opportunity where I was tasked with crafting a responsive landing page focused on providing information and resources. As the developer, I ensured a pixel-perfect design and user-friendly navigation, catering to the project's specific audience and needs.",
      "I focused on designing and developing a responsive landing page that provided valuable medical resources, implementing a user-friendly navigation system for better accessibility. By optimizing the website layout, I enhanced readability and user engagement.",
      "This freelance project allowed me to apply my skills in web development and user experience design, contributing to a platform that offered valuable information and resources to its users."
    ]
  }
]
